backend/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
    def index
        team = Team.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        team = Team.find(params[:id])

INSERT INTO "teams" ("name", "mascot", "standing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Team Weed"], ["mascot", ""], ["standing", 9], ["created_at", "2022-12-05 22:11:56.769514"], ["updated_at", "2022-12-05 22:11:56.769514"]]
---
    def create
        team = Team.create!(teams_params)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 9]]
---
    def destroy
        team = Team.find_by!(id: params[:id])
        team.destroy